driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSBatchCCTest_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://j2ee.netbeans.org/wsdl/JMSBatchCCTest/types">
  <soapenv:Body>
    <typ:MsgOnly>
      <Msg>A text message paylaod; JMSBatchCCTest trigger message</Msg>
    </typ:MsgOnly>
  </soapenv:Body>
</soapenv:Envelope>